RubyAssignment/project/app/controllers/comments_controller.rb

  def create
 @post =Post.find(params[:post_id])
 @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "ghsdgsghgd"], ["post_id", 1], ["created_at", "2018-04-18 06:17:11.817211"], ["updated_at", "2018-04-18 06:17:11.817211"]]