RubyAssignment/project/app/views/posts/show.html.erb

   <h2>Comments</h2>
<% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]